In [3]:
import numpy as np 
import pandas as pd

In [4]:
labels = ['a','b','c']
pd.Series(data=labels)

0    a
1    b
2    c
dtype: object

In [5]:
pd.Series([sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [6]:
#creating series from a python list
labels = ['a','b','c']
my_list = [10,20,30]
arr = np.array([10,20,30])
d = {'a':10, 'b':20, 'c':30}

In [7]:
pd.Series(data=my_list)

0    10
1    20
2    30
dtype: int64

In [8]:
pd.Series(data=my_list, index=labels)

a    10
b    20
c    30
dtype: int64

In [9]:
pd.Series(my_list,labels)

a    10
b    20
c    30
dtype: int64

In [10]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int32

In [11]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int32

In [12]:
#creating a series from dictionary
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [13]:
#creating a dataframe from list
a = [i for i in range(1,5)]
b = [i for i in range(5,9)]
c = [i for i in range(9,13)]

In [14]:
pd.DataFrame(data=[a,b,c], index='a b c'.split(), columns='w x y z'.split())

   w   x   y   z
a  1   2   3   4
b  5   6   7   8
c  9  10  11  12

In [15]:
pd.DataFrame(data=list(zip(a,b,c)), index='w x y z'.split(), columns='a b c'.split())

   a  b   c
w  1  5   9
x  2  6  10
y  3  7  11
z  4  8  12

In [16]:
#creating a dataframe from a list
my_list = [[1,2,3,4],[5,6,7,8],[9,10,11,12]]
pd.DataFrame(my_list, index='a b c'.split(), columns='w x y z'.split())

   w   x   y   z
a  1   2   3   4
b  5   6   7   8
c  9  10  11  12

In [17]:
pd.DataFrame(my_list, index='a b c'.split(), columns='w x y z'.split()).T

   a  b   c
w  1  5   9
x  2  6  10
y  3  7  11
z  4  8  12

In [20]:
#creating a dataframe from an array
from numpy.random import randn
np.random.seed(101)

In [21]:
df = pd.DataFrame(randn(5,4), index='A B C D E'.split(),columns='W X Y Z'.split())
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [22]:
#creating dataframe from a dictionary
my_d = {'a':[1,2,3,4],'b':[5,6,7,8],'c':[9,10,11,12]}
pd.DataFrame(my_d, index='w x y z'.split())

   a  b   c
w  1  5   9
x  2  6  10
y  3  7  11
z  4  8  12

In [23]:
df.loc['new']=[1,2,3,4]
df

            W         X         Y         Z
A    2.706850  0.628133  0.907969  0.503826
B    0.651118 -0.319318 -0.848077  0.605965
C   -2.018168  0.740122  0.528813 -0.589001
D    0.188695 -0.758872 -0.933237  0.955057
E    0.190794  1.978757  2.605967  0.683509
new  1.000000  2.000000  3.000000  4.000000

In [24]:
df['new'] = df['W'] + df['Y']
df

            W         X         Y         Z       new
A    2.706850  0.628133  0.907969  0.503826  3.614819
B    0.651118 -0.319318 -0.848077  0.605965 -0.196959
C   -2.018168  0.740122  0.528813 -0.589001 -1.489355
D    0.188695 -0.758872 -0.933237  0.955057 -0.744542
E    0.190794  1.978757  2.605967  0.683509  2.796762
new  1.000000  2.000000  3.000000  4.000000  4.000000

In [25]:
df.insert(3,'baru',[1,2,3,4,5,6])
df

            W         X         Y  baru         Z       new
A    2.706850  0.628133  0.907969     1  0.503826  3.614819
B    0.651118 -0.319318 -0.848077     2  0.605965 -0.196959
C   -2.018168  0.740122  0.528813     3 -0.589001 -1.489355
D    0.188695 -0.758872 -0.933237     4  0.955057 -0.744542
E    0.190794  1.978757  2.605967     5  0.683509  2.796762
new  1.000000  2.000000  3.000000     6  4.000000  4.000000

In [27]:
#deleting data removing columns without inplace
df.drop('new',axis=1)

            W         X         Y  baru         Z
A    2.706850  0.628133  0.907969     1  0.503826
B    0.651118 -0.319318 -0.848077     2  0.605965
C   -2.018168  0.740122  0.528813     3 -0.589001
D    0.188695 -0.758872 -0.933237     4  0.955057
E    0.190794  1.978757  2.605967     5  0.683509
new  1.000000  2.000000  3.000000     6  4.000000

In [28]:
df

            W         X         Y  baru         Z       new
A    2.706850  0.628133  0.907969     1  0.503826  3.614819
B    0.651118 -0.319318 -0.848077     2  0.605965 -0.196959
C   -2.018168  0.740122  0.528813     3 -0.589001 -1.489355
D    0.188695 -0.758872 -0.933237     4  0.955057 -0.744542
E    0.190794  1.978757  2.605967     5  0.683509  2.796762
new  1.000000  2.000000  3.000000     6  4.000000  4.000000

In [32]:
df.drop('new',axis=0 and 1, inplace=True)

KeyError: "['new'] not found in axis"

In [33]:
df

          W         X         Y  baru         Z       new
A  2.706850  0.628133  0.907969     1  0.503826  3.614819
B  0.651118 -0.319318 -0.848077     2  0.605965 -0.196959
C -2.018168  0.740122  0.528813     3 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237     4  0.955057 -0.744542
E  0.190794  1.978757  2.605967     5  0.683509  2.796762

In [34]:
df.drop('new',axis=1, inplace=True)

In [35]:
df

          W         X         Y  baru         Z
A  2.706850  0.628133  0.907969     1  0.503826
B  0.651118 -0.319318 -0.848077     2  0.605965
C -2.018168  0.740122  0.528813     3 -0.589001
D  0.188695 -0.758872 -0.933237     4  0.955057
E  0.190794  1.978757  2.605967     5  0.683509

In [36]:
df.drop('baru',axis=1, inplace=True)

In [37]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [38]:
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [40]:
newidx = 'JA BO DE TA BEK'.split()
newidx

['JA', 'BO', 'DE', 'TA', 'BEK']

In [41]:
df['Kota'] = newidx
df

          W         X         Y         Z Kota
A  2.706850  0.628133  0.907969  0.503826   JA
B  0.651118 -0.319318 -0.848077  0.605965   BO
C -2.018168  0.740122  0.528813 -0.589001   DE
D  0.188695 -0.758872 -0.933237  0.955057   TA
E  0.190794  1.978757  2.605967  0.683509  BEK

In [42]:
df.set_index('Kota')

             W         X         Y         Z
Kota
JA    2.706850  0.628133  0.907969  0.503826
BO    0.651118 -0.319318 -0.848077  0.605965
DE   -2.018168  0.740122  0.528813 -0.589001
TA    0.188695 -0.758872 -0.933237  0.955057
BEK   0.190794  1.978757  2.605967  0.683509

In [43]:
df

          W         X         Y         Z Kota
A  2.706850  0.628133  0.907969  0.503826   JA
B  0.651118 -0.319318 -0.848077  0.605965   BO
C -2.018168  0.740122  0.528813 -0.589001   DE
D  0.188695 -0.758872 -0.933237  0.955057   TA
E  0.190794  1.978757  2.605967  0.683509  BEK

In [44]:
df.set_index('Kota',inplace=True)

In [45]:
df

             W         X         Y         Z
Kota
JA    2.706850  0.628133  0.907969  0.503826
BO    0.651118 -0.319318 -0.848077  0.605965
DE   -2.018168  0.740122  0.528813 -0.589001
TA    0.188695 -0.758872 -0.933237  0.955057
BEK   0.190794  1.978757  2.605967  0.683509